[{"id":"project1","title":"Solace","cardline":"A mental health app that enables self-screening for traumatised individuals, provides personalised treatment recommendations, and aids in the process of seeking help.","imageURL":"/projects/solace/img/solace.webp","description":"Hej","specifications":[{"Type":"Master's Thesis Project in Interaction Design","Team":[{"Team1":"Dorian Irilone (Principal UX Designer & Developer)","Team2":"José Bener (Illustration & Design Specialist)"}],"Duration":"January - June 2024"}],"stages":[{"name":"Challenge","description":"Overview of the Solace project's aims and outcomes.","content":[{"type":"text","id":"solace-challenge-text-1","headline":"Challenge Description","body":"The primary objective of this project is to develop a high-fidelity prototype for a mobile application that explicitly focuses on trauma recovery. This prototype addresses key usability and engagement issues, ensuring the application is accessible and practical for individuals with trauma-related disorders. The project's focus on trauma recovery is paramount, as it aims to bridge the gaps in mental health service utilisation, hindered by barriers such as stigma, limited resource availability, and poor mental health literacy. By prioritising user experience design, the project aims to establish a strong foundation for a complete application that can provide self-help strategies and psychoeducation and facilitate access to professional help in a user-friendly manner. I will develop the full application after completing the thesis project."},{"type":"image","id":"solace-challenge-image","url":"/projects/solace/img/onboarding.webp","description":"Solace onboarding"},{"type":"text","id":"solace-challenge-text-2","headline":"Key Points","body":[{"Focus of the Project":"High-fidelity prototype development for UX optimisation in a trauma recovery app.","User Engagement":"Ensuring the prototype is intuitive and engaging to encourage consistent use.","Addressed Barriers":"Tackling stigma, time constraints, and lack of knowledge about treatment options through design.","Prototype Features":"Emphasising critical visual and interactive elements to enhance clarity and ease of use.","Post-Project Plan":"Prototype to serve as a blueprint for developing a complete application.","Final Application Intention":"Provide users with comprehensive insights into disorders, various therapeutic tools, and traditional therapies to empower them to make informed decisions about their treatment paths."}]}]},{"name":"Users","description":"Overview of the Solace project's aims and outcomes.","content":[{"type":"text","id":"solace-users-text-1","headline":"User Involvement","body":"The project focused on optimising user experience in designing a trauma-related mental health application, engaging users throughout the design process to ensure the final product was effective and user-friendly. The initial stages involved low-fidelity prototyping and gathering expert feedback to identify essential design elements for PTSD/CPTSD screening and treatment recommendations. This process evolved into developing a high-fidelity prototype, emphasising critical visual and interactive elements to boost user engagement. Subsequent user experience testing with qualitative questions combined with UEQ+ scales provided insights into enhancing attractiveness, efficiency, clarity, usefulness, and visual aesthetics. Feedback from these tests guided final adjustments to refine the prototype, focusing on scalability and user experience continuity in full application development."},{"type":"image","id":"solace-challenge-image","url":"/projects/solace/img/form.webp","description":"Solace form"},{"type":"text","id":"solace-users-text-2","headline":"Key Points","body":[{"Initial Expert Feedback":"Influenced foundational design decisions for low-fidelity prototypes.","Continuous Expert Consultations":"Helped shape the prototype's features and ensure user safety.","High-Fidelity Prototyping":"Focused on enhancing visual and interactive elements critical for user engagement.","Usability Testing":"Utilised UEQ+ scales to measure and improve application attractiveness and usability.","Iterative Feedback Integration":"Continuous user feedback informed successive refinements, ensuring the application met real user needs.","Scalability Consideration":"The methodologies adopted in the final stages ensured that the prototype's design was scalable for complete application development."}]}]},{"name":"Solution","description":"Exploring different possibilities and directions for the project.","content":[{"type":"text","id":"solace-solution-text-1","headline":"Design Process","body":"The Solace project embarked on a mission to develop a high-fidelity prototype for a mobile application tailored to individuals recovering from trauma. This prototype tackled key usability and engagement issues, making the application accessible and practical for users facing trauma-related disorders. The project went through multiple iterative cycles throughout the development process, starting from low-fidelity prototyping and evolving into a sophisticated high-fidelity prototype. User experience (UX) was at the forefront, incorporating extensive user testing with qualitative questions and UEQ+ scales to gather actionable feedback. This feedback informed continuous refinements, enhancing visual elements and interactive functionalities crucial for user engagement and satisfaction. The final prototype boasts an intuitive user interface, personalised therapeutic tools, and educational resources to demystify mental health care and promote self-help strategies. Click the thumbnail below to try the high-fidelity prototype. Beware that the final implementation based on the user feedback has not been applied yet."},{"type":"website-thumbnail","id":"solace","url":"https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Fproto%2FkkYVXoLsDIReEyqGOqBeuE%2FSolace-3%3Fpage-id%3D2005%253A2166%26type%3Ddesign%26node-id%3D2005-2591%26viewport%3D-770%252C193%252C0.61%26t%3DEedy3uepTFKzoQiB-1%26scaling%3Dscale-down%26starting-point-node-id%3D2005%253A2591%26hotspot-hints%3D0%26mode%3Ddesign&disable-default-keyboard-nav=1&mode=design&hide-ui=1&show-proto-sidebar=0","thumbnail":"projects/solace/img/home.webp","description":"Prototype Website"},{"type":"text","id":"solace-solution-text-2","headline":"Key Points","body":[{"Expert Advice":"Shaped foundational UX decisions, focusing on safety and efficacy for trauma-sensitive users.","Iterative Design and Testing":"Utilised low—to high-fidelity prototypes to refine the app based on user and expert feedback","Enhanced Visual and Interactive Elements":"Prioritised aesthetics and usability to ensure the app's interface is user-friendly and engaging.","Personalised User Experience":"Integrated a self-assessment tool that tailors content and recommendations to individual user needs.","AI-Based Therapeutic Concept":"Introduced the concept of an AI therapist, Dr. Solace, who can provide conversational support and bridge the gap to professional care.","Scalable and Adaptable Design":"Ensured the prototype's scalable design, setting a solid foundation for future full-scale application development."}]}]},{"name":"Takeaways","description":"Takeaways","content":[{"type":"text","id":"solace-takeaways-text","headline":"Project Takeaways","body":[{"topic":"Enhancing Accessibility and Engagement in Trauma Recovery Applications","challenge":"Addressing the gap in mental health service utilisation due to stigma, limited resources, and poor mental health literacy.","solution":"Development of a high-fidelity prototype for a mobile application focused on trauma recovery, incorporating user-centred design principles to enhance accessibility and engagement.","impact":"The prototype aims to make mental health resources more accessible, reduce stigma, and improve engagement through an intuitive and user-friendly interface, paving the way for a comprehensive application that provides self-help strategies and psychoeducation."},{"topic":"Prioritising User Experience in Mental Health Application Design","challenge":"Ensuring that the trauma recovery app is not only functional but also engaging and easy to use for individuals with trauma-related disorders.","solution":"Engaging users throughout the design process, from low-fidelity prototyping to high-fidelity prototype development, focusing on optimising visual and interactive elements.","impact":"The iterative design process, informed by user feedback and expert consultations, resulted in a prototype that is both attractive and practical, enhancing user experience and ensuring continuity in full application development."},{"topic":"Overcoming Barriers to Mental Health Through Thoughtful Application Features","challenge":"Tackling prevalent issues such as stigma and lack of knowledge about treatment options, which hinder the effective use of mental health applications.","solution":"The application addresses these barriers by integrating features that promote understanding and managing trauma through educational content and direct links to professional help.","impact":"By providing valuable resources and information, the app empowers users to take informed steps towards recovery, potentially increasing the utilisation of mental health services."},{"topic":"Setting a Foundation for Scalable Mental Health Solutions","challenge":"Creating a scalable and effective digital solution that can adapt to the varied needs of users experiencing trauma.","solution":"The prototype serves as a blueprint for the development of a complete application, designed with scalability in mind, incorporating features that support a wide range of user needs.","impact":"This foundational work enables the development of a full-scale application that can dynamically adapt to user feedback and evolve, offering a sustainable and impactful tool in mental health recovery."}]}]}]},{"id":"project2","title":"Papyrus","cardline":"A project harnessing web technologies to optimise the interaction with academic literature, focusing on accessibility and usability.","imageURL":"/projects/papyrus/img/papyrus-logo.webp","description":"Final prototype","specifications":[{"Type":"Open Project in Interaction Design","Team":[{"Team1":"Dorian Irilone (Product Engineer)","Team2":"Ludwig Johander (Head of Innovation)"}],"Duration":"November 2023 - February 2024"}],"stages":[{"name":"Challenge","description":"Papyrus project summary.","content":[{"type":"text","id":"papyrus-challenge-text-1","headline":"Challenge Description","body":"Academic literature in PDF format encounters significant usability and accessibility challenges, with difficulties in adapting to various screen sizes, unsatisfying annotation and highlighting, and providing adequate support for visually impaired users. Despite the advantages of the EPUB format, its adoption is slow due to the dominance of PDFs and various technical and cost barriers."},{"type":"image","id":"papyrus-design-image","url":"/projects/papyrus/img/challenge.webp","description":"Papyrus design"},{"type":"text","id":"papyrus-challenge-text-2","headline":"Key Points","body":[{"Rigid Layout Issues":"PDFs' static layouts are not responsive to different screen sizes, leading to poor readability on devices other than traditional computers.","Character Recognition Errors":"Frequent errors in character recognition plague PDFs, which can significantly disrupt highlighting and annotation.","Inadequate Support for Visual Impairments":"PDFs often lack structured navigation aids and use intricate layouts, making them less usable for visually impaired readers relying on text-to-speech software.","Limited EPUB Adoption":"Despite its potential for better usability and accessibility, EPUB's uptake is slow due to the academic community's established familiarity with PDF format and the lack of proper citation features.","Economic Barriers for Publishers":"Smaller publishers face cost challenges in adopting the EPUB format, which hinders broader dissemination and accessibility.","Inadequate Reference Management Tools":"Existing bibliographic tools do not adequately address usability and accessibility challenges, and they do not integrate well with newer formats like EPUB."}]}]},{"name":"Users","description":"Ideas and concepts behind the Papyrus project.","content":[{"type":"text","id":"papyrus-users-text","headline":"User-Centred Design","body":"The project utilised a user-centred design approach by conducting semi-structured interviews with academics and researchers to understand their reading and organisational habits and then conducting co-design interviews with our high-fidelity prototype to gather feedback. Users displayed diverse preferences, from digital to paper-based reading, highlighting the need for flexible design to accommodate various annotation styles. Key improvements identified included enhanced document navigation and searchable annotations to connect academic works better. Additionally, feedback on accessibility issues with screen-readers informed ongoing design refinements, emphasising the importance of inclusivity in user-centred design to effectively cater to academic users' specific needs and practices."},{"type":"image","id":"papyrus-users-image2","url":"/projects/papyrus/img/annotations.webp","description":"User requested features"},{"type":"text","id":"papyrus-users-text-2","headline":"Key Points","body":[{"User Involvement":"Extensive user engagement through semi-structured interviews and co-design sessions.","Iterative Design":"Non-linear, iterative process emphasising requirement discovery, prototyping, and user testing.","Feedback Implementation":"User feedback led to specific design enhancements in readability, navigation, and annotation capabilities.","Prototyping Tools":"Utilised Figma for higher-fidelity prototyping, allowing real-time user interaction and feedback collection.","Diverse User Base":"Targeted a varied group of academics to ensure the tool meets diverse needs across different disciplines.","Outcome":"Developed a minimum viable product incorporating essential features based on academic user requirements and feedback."}]}]},{"name":"Solution","description":"Exploratory phase for Papyrus, including research and conceptualisation.","content":[{"type":"text","id":"papyrus-solution-text","headline":"Design Process","body":"Detailed qualitative data from academics at various career stages thoroughly informed Project Papyrus's design process. The goal was to enhance the academic reading and organisational experience. Initial feedback underscored the diverse, often print-based, reading preferences and highlighted the need for flexible annotation and organisation tools. Iterations led to developing a minimum viable product (MVP) using HTML, CSS, and JavaScript, emphasising easy navigation and interaction through a simplified digital library interface. The MVP allows for efficient management of academic papers with customisable tags and quick search functionalities. This prototype serves as a primary platform demonstrating essential features to improve the management and consumption of academic literature with future enhancements planned to incorporate more robust interactive and accessibility features. Click the thumbnail below to try the prototype"},{"type":"website-thumbnail","id":"2","url":"https://project-papyrus.netlify.app/","thumbnail":"projects/papyrus/img/papyrus.webp","description":"Prototype Website"},{"type":"text","id":"papyrus-solution-text-2","headline":"Key Points","body":[{"Initial User Feedback":"Gathered insights from academics regarding their reading habits and organisational strategies, highlighting a mix of digital and print preferences with various annotation methods.","Concept Development":"Focused on creating a digital solution that accommodates the flexibility of print annotation while integrating the benefits of digital tools, leading to the MVP concept.","MVP Features":" Developed with HTML, CSS, and JavaScript, the MVP offers a library view with a central search bar, dynamic filters, and paper previews, avoiding traditional folder structures for more straightforward navigation.","Interactivity and Readability":"The MVP includes features such as interactive annotations, a responsive HTML format for papers, and a dynamic table of contents to enhance the reading experience.","Search and Organisation":"Implementation of advanced search functionalities allowing users to tag and categorise papers based on relevance to specific projects, enhancing document retrieval without duplication.","Future Enhancements":"Planned expansions include more sophisticated search capabilities, mobile versions, accessibility settings, and integration with Large Language Models to aid in summarisation and research navigation."}]}]},{"name":"Takeaways","description":"Developing prototypes for the Papyrus interface.","content":[{"type":"text","id":"papyrus-takeaways-text","headline":"Project Takeaways","body":[{"topic":"Adapting PDFs to Digital User Experience","challenge":"PDF format limitations hinder adaptation to dynamic digital platforms and various screen sizes.","solution":"Created software to convert academic papers into web-native formats, utilising modern web technologies.","impact":"Emphasised adopting web standards for dynamic content adaptation in future designs."},{"topic":"Balancing Print and Digital Reading Preferences","challenge":"Addressing preferences for print reading due to its comprehension benefits and tactile experience.","solution":"Developed digital tools that maintained the benefits of print, including features mimicking print annotations.","impact":"User-centric insights will steer the development of future hybrid solutions, placing user needs at the forefront of design."},{"topic":"User Engagement and Feedback Incorporation","challenge":"Difficulties in engaging users and integrating feedback into the software design process.","solution":"Adopted a co-design approach with user interviews and prototype testing for iterative refinements.","impact":"Success highlights the critical role of ongoing user engagement and feedback in development."},{"topic":"Technical Complexity of Developing New Features","challenge":"Challenges integrating features like HTML conversion and advanced search functionalities.","solution":"Utilised existing technologies and formed partnerships, focusing on a robust technical foundation.","impact":"Demonstrated the benefits of strategic partnerships and using open-source tools for efficient feature development."}]}]}]},{"id":"project3","title":"SOS Alarm","cardline":"Enhancing emergency response efficiency through cognitive ergonomics and innovative human-machine interaction.","imageURL":"/projects/sos-alarm/img/sosalarm.webp","description":"SOS Alarm","specifications":[{"Type":"Cognitive Ergonomics","Team":[{"Team1":"Dorian Irilone (Cognitive Ergonomics Analyst)","Team2":"Ludwig Johander (Cognitive Ergonomics Analyst & Designer)","Team3":"Liina Tumma (Cognitive Ergonomics Analyst)"}],"Duration":"November 2023 - January 2024"}],"stages":[{"name":"Challenge","description":"Project Overview and Key Issues","content":[{"type":"text","id":"sos-challenge-text-1","headline":"Challenge Description","body":"This project tackles the challenge of improving cognitive ergonomics in the SOS Alarm emergency call centre, focusing on enhancing the interaction between human operators and the alarm system to optimise response in emergency situations. This report delves into improving cognitive and physical aspects of human-machine interaction to reduce operator workload, enhance usability, and minimise ergonomic issues. The study utilises the Combined Cognitive and Physical Evaluation (CCPE) methodology to systematically identify and address potential system deficiencies that could affect operators' performance during high-pressure emergency handling."},{"type":"image","id":"sos-users-image1","url":"/projects/sos-alarm/img/gtk.webp","description":"image"},{"type":"text","id":"sos-challenge-text-2","headline":"Key Points","body":[{"Core Challenge":"Enhancing cognitive ergonomics for better interaction between operators and emergency systems.","Methodology":"The Combined Cognitive and Physical Evaluation (CCPE) is used to evaluate and improve human-machine interactions.","Focus Areas":"Addressing high workload, usability problems, and physical ergonomic errors.","Evaluation Phases":"Includes workload and interaction analyses to assess system usability under stress.","System Users":"Primary users are operators and dispatchers who handle intense, life-threatening emergency calls.","Goal of Evaluation":"To provide recommendations on refining the SOS alarm system to ensure it is efficient, reliable, and user-friendly under emergency conditions."}]}]},{"name":"Users","description":"Involvement in the Design Process","content":[{"type":"text","id":"sos-users-text-1","headline":"User Evaluation","body":"The project embraced a user-centred design approach, deeply involving expert users through over six hours of observations and interviews. This method provided a comprehensive view of the operators' practical and cognitive challenges, particularly in their interactions with the emergency management software. The analysis revealed significant insights into optimising attention management and reducing cognitive load. The project proposed design improvements aimed at streamlining information processing and minimising potential errors by pinpointing where the system could better support operators. These targeted changes aimed to enhance usability, improve response efficiency, and reduce fatigue among operators, thereby creating a more effective emergency response environment."},{"type":"image","id":"sos-users-image1","url":"/projects/sos-alarm/img/helpseekercase.webp","description":"image"},{"type":"text","id":"sos-challenge-text-2","headline":"Evaluation Highlights","body":[{"Observational Methods":"Experts were observed in actual working conditions to understand their interaction with the system.","Attention Management":"Insights into how operators manage their focus and attention across multiple information streams.","Feedback Utilisation":"Observations identified areas where the system could be improved to support better attention management and reduce cognitive overload.","User-Centred Adjustments":"Based on observed challenges, we adjusted our suggestions for system modifications to enhance usability and reduce errors.","Continuous Involvement":"Users were continuously involved in the design process, providing ongoing feedback that significantly influenced iterative design changes.","Empathetic Design Focus":"The design process was heavily influenced by the need to understand and alleviate users' high cognitive and emotional demands."}]}]},{"name":"Solution","description":"Exploring the artistic and technical aspects of SOS Alarm.","content":[{"type":"text","id":"sos-solution-text-1","headline":"Design Process","body":"The recommendations and guidelines proposed for SOS Alarm aim to optimise the interaction between operators and their human-machine systems. These guidelines focus on integrating cognitive ergonomics to enhance usability, safety, and efficiency within stressful operational environments. The design concept explores a dynamic GUI layout, using workspace canvases inspired by whiteboard software to improve intuitive use and reduce cognitive load. Iterative feedback from system users was essential in refining these elements, emphasising real-time information accessibility, error reduction, and user-friendly navigation. The final recommendations promote a seamless integration of technology and human factors to aid operators in making swift, accurate emergency decisions."},{"type":"image","id":"sos-users-image1","url":"/projects/sos-alarm/img/solution.webp","description":"image"},{"type":"text","id":"sos-solution-text-2","headline":"Key Points","body":[{"Initial Observations and Feedback":"Started with evaluating existing systems and collecting operator feedback to identify key stress points and inefficiencies.","Cognitive Ergonomics":"Focus on reducing cognitive load through intuitive design and clear, logical information presentation, essential for high-stakes decision-making environments.","Dynamic GUI Layout Proposal":"Introduced a workspace canvas model for the GUI to more closely mirror operators' mental models of emergency scenes, enhancing intuitive navigation.","Refinement through Iterative Design":"Utilised iterative testing and feedback to refine the GUI, ensuring the design supported rapid information retrieval and minimised error rates","Enhanced Error Correction":"Implemented auto-corrective features and real-time updates to support efficient operational flow and enhance system reliability.","Accessibility and Efficiency":"The guidelines stressed the importance of a high-contrast, readable interface and auditory clarity, catering to diverse operator needs and operational demands."}]}]},{"name":"Takeaways","description":"Takeaways","content":[{"type":"text","id":"sosalarm-takeaways-text","headline":"Project Takeaways","body":[{"topic":"Enhancing Emergency Response","challenge":"There is a need to improve the usability and efficiency of emergency call centre systems to cope effectively with high-stress situations and cognitive loads.","solution":"Cognitive ergonomics is used in the analysis, design, and operation of human-machine systems, focusing on the interaction between the system and its human operators.","impact":"The integration aimed to make the systems more user-friendly, safe, reliable, and operable, thereby increasing performance and reducing operator stress during emergencies."},{"topic":"Advancing Intuitive System Interaction for Faster Emergency Assessments","challenge":"SOS Alarm operators require an intuitive system to enhance their ability to quickly assess and respond to emergencies.","solution":"We redesigned the user interface to be more intuitive, simplifying information presentation and strengthening the system's searchability and navigation capabilities.","impact":"This led to quicker and more accurate emergency assessments, reduced time to action, and decreased cognitive overload for operators."},{"topic":"Incorporating Flexible Design to Enhance Situational Awareness","challenge":"The existing system lacked flexibility, making it hard for operators to adapt to rapidly changing emergency scenarios.","solution":"Implement a workspace canvas concept, inspired by software like Miro and Canva, to allow the dynamic arrangement of interface elements in accordance with operators' mental models.","impact":"Improved situational awareness and adaptability in emergency handling, with a design that supports operators in visualising and managing emergency scenes more effectively."},{"topic":"Implementing Advanced Navigation Tools to Improve Response Times","challenge":"Navigational inefficiencies in the system interface slowed the emergency response times.","solution":"Explored the potential of keyboard navigation to enhance the speed and accuracy of system operation, borrowing concepts from real-time strategy games to develop an intuitive schema of keybindings.","impact":"Proposed improvements in system navigation are expected to significantly reduce response times and enhance the overall efficiency of emergency operations."}]}]}]},{"id":"project4","title":"Synchronicity","cardline":"Enhance team cohesion in a shadowy post-apocalyptic game, synchronising poses to survive through immersive, cooperative play.","imageURL":"/projects/synchronicity/img/thumbnail.webp","description":"Ej","specifications":[{"Type":"Interaction Design Project","Team":[{"Team1":"Dorian Irilone (Interactive Web Developer)","Team2":"José Bener (Game Illustrator & Designer)","Team3":"Zelei Weng (Game Systems Engineer)","Team4":"Yue Lou (UX Researcher)","Team5":"Natthamon Pongchanchai (UX Researcher)","Team6":"Emma Pettersson (Project Coordinator)","Team7":"Sara Persson (AI Audio Engineer)"}],"Duration":"September - November 2023"}],"stages":[{"name":"Challenge","description":"Synchronicity project overview and objectives.","content":[{"type":"text","id":"synchronicity-challenge-text-1","headline":"Challenge Description","body":"The Synchronicity project presents an exciting opportunity to overcome the challenge of enhancing team cohesion. Through immersive, escape-themed experiences that leverage discomfort to promote bonding, we can envision a future where teams are more united and collaborative. Drawing inspiration from Tuckman's phases of group development, the project aims to physically and emotionally engage teams, pushing them through a series of interactions that challenge and unite them. The incorporation of motion capture technology, along with visual and auditory elements, is intended to intensify the experience, making escaping a deeply collaborative and bonding process."},{"type":"image","id":"synchronicity-users-image1","url":"/projects/synchronicity/img/gameplay.webp","description":"image"},{"type":"text","id":"synchronicity-challenge-text-2","headline":"Key Points","body":[{"Problem Adressed":"Lack of deep team cohesion and ineffective collaboration in group settings.","Use of Technology":"Utilisation of motion capture alongside visual and auditory elements to create an immersive experience.","Team Development Phases":"Designed to guide teams through Tuckman's phases—forming, storming, norming, performing, and adjourning.","Role of Discomfort":"Utilises uncomfortable interactions to foster a stronger bond among team members.","Protective Frames":"Implementation of a safety mechanism that allows participants to engage deeply without real-life risks.","Behavioural Influence":"Fogg's Behavior Model is applied to strategically enhance participation and engagement through motivation, ability, and triggers."}]}]},{"name":"Users","description":"Conceptualisation phase of the Synchronicity game.","content":[{"type":"text","id":"synchronicity-users-text-1","headline":"Co-design","body":"The design process for this project strongly emphasised user-centred principles, starting with the Design Thinking methodology, which included empathising with potential users, defining the problem, ideating solutions, prototyping, and testing. User involvement was integral at multiple stages, particularly during the prototyping and testing phases, where we utilised continuous user feedback to refine the gameplay and user experience. This iterative interaction with users helped the team adjust the project’s direction effectively based on real-time feedback and testing outcomes."},{"type":"image","id":"synchronicity-users-image1","url":"/projects/synchronicity/img/seesaw.webp","description":"image"},{"type":"text","id":"synchronicity-challenge-text-2","headline":"Key Points","body":[{"Early Involvement":"Engaged users from ideation to the final testing.","Continuous Testing":"Regular playtest sessions allowed for ongoing feedback and immediate application to the development process.","User Feedback in Prototyping":"Influenced adjustments in-game poses and interaction dynamics for better engagement and accessibility.","Evolving Concept":"Initial pitches adjusted based on feedback, focusing on creating a relevant and engaging user experience.","Prototype Adjustments":"Modifications include changing poses and adjusting the visual and audio components based on user interactions.","Final Adjustments":"Colour adjustments in the visual design to accommodate users with colour vision differences, enhancing accessibility."}]}]},{"name":"Solution","description":"Solution","content":[{"type":"text","id":"synchronicity-solution-text-1","headline":"Iterative Design and Immersive Prototyping","body":"The Synchronicity project stands out for its unique approach, crafting an immersive, escape-themed experience that seamlessly integrates teamwork into its core. This is achieved through an interactive environment that harnesses the power of motion capture technology. The design process, guided by the iterative Design Thinking methodology, was focused on creating an engaging narrative that required users to work together in physically and strategically challenging settings. The final prototype offered an audiovisual escape room experience where participants navigated through a series of poses to advance, with their movements captured and translated into on-screen avatars. This setup fostered team bonding by pushing players through uncomfortable yet cooperative interactions. Click the thumbnail below to try the prototype, and be sure to scroll all the way down to reach safety."},{"type":"website-thumbnail","id":"3","url":"https://synchronicity-ixd.netlify.app/","thumbnail":"projects/synchronicity/img/thumbnail.webp","description":"Prototype Website"},{"type":"text","id":"synchronicity-users-text-2","headline":"Key Points","body":[{"Iterative Design Process":"Employed Design Thinking to explore, prototype, and refine the experience based on continuous feedback, starting from divergent ideas to a cohesive final concept.","Teamwork-Driven Narrative":"This narrative was built around a story that required cooperative interaction, aligning with Tuckman's team development phases, to enhance group cohesion and performance.","Motion Capture Integration":"Utilised motion capture technology to create interactive gameplay where player movements were crucial to progressing and solving in-game challenges.","Immersive Audiovisual Elements":"We combined crafted 3D environments and AI-generated voice acting to deepen immersion and maintain narrative engagement.","Adaptive Gameplay Mechanics":"Included elements like protective frames and real-time feedback to keep interactions within comfortable limits while maintaining a challenging experience.","Focus on User Experience":"The design included multiple testing phases to ensure the game was intuitive, engaging, and accessible, incorporating user feedback to fine-tune interaction and gameplay."}]}]},{"name":"Takeaways","description":"Takeaways","content":[{"type":"text","id":"syncrhonicity-takeaways-text","headline":"Project Takeaways","body":[{"topic":"Enhancing Team Cohesion","challenge":"The project aimed to foster team development by encouraging participants to navigate through Tuckman's stages of group development engagingly and collaboratively.","solution":"The Synchronicity project utilised an escape-themed game designed to make participants work together under stress, enhancing social bonds and collaboration through shared experiences.","impact":"Participants reported increased feelings of teamwork and unity, indicating that the experience effectively promoted group development and could potentially be used as a tool for team-building in various settings."},{"topic":"Creating Meaningful Experiences with Uncomfortable Interactions","challenge":"Deepen engagement in interactive experiences by integrating elements of discomfort, aiming to create meaningful and memorable interactions.","solution":"Implemented uncomfortable interactions within the game, using these to drive social bonding and collective problem-solving among participants.","impact":"The project harnessed discomfort to enhance social connectivity, demonstrating that shared challenging experiences can significantly foster social bonding and improve the overall group experience."},{"topic":"Balancing Immersion with Safety in Interactive Design","challenge":"Ensuring participants remain fully immersed in a high-intensity, escape-themed game without feeling danger, which could detract from the experience.","solution":"Protective frames were utilised within the game's design to maintain a safe, controlled environment that simulated stress and discomfort without exposing players to risks.","impact":"This approach allowed participants to engage deeply with the experience without concerns for their safety, thereby maintaining immersion and enhancing the overall effectiveness of the experience."},{"topic":"Advancing Teamwork","challenge":"To design an experience that entertains and builds real-world skills like teamwork and cooperation in an immersive setting.","solution":"Integrated motion capture technology to create a collaborative, escape-themed game that requires players to synchronise their actions and work as a cohesive unit to progress.","impact":"Advanced technology facilitated a unique, interactive environment where teamwork was essential, effectively improving participants' ability to cooperate under pressure and providing a novel real-time platform for studying team dynamics."}]}]}]},{"id":"project5","title":"SonArt","cardline":"A ritualistic, art-focused interaction with sonar sensors for restoring artworks, fostering engagement and reducing stress.","imageURL":"/projects/sonart/img/logo.webp","description":"SonArt was a group project in the Tangible Interaction course.","specifications":[{"Type":"Tangible Interaction","Team":[{"Team1":"Dorian Irilone (Tangible Interaction Designer)","Team2":"Ludwig Johander (Lead Tangible Interaction Designer & Fabricator)","Team3":"Filip Lundström (Conceptual Designer)","Team4":"Ismael Albutihe (Supporting Interaction Designer)"}],"Duration":"January - March 2023"}],"stages":[{"name":"Challenge","description":"Overview of the Sonart project's concept and purpose.","content":[{"type":"text","id":"sonart-challenge-text-1","headline":"Challenge Description","body":"The project's primary challenge is the adverse impact of stress, especially in Western cultures characterised by high-stress lifestyles and a disposable attitude towards objects. The project's unique proposition is the creation of an artefact that demands continuous interaction and maintenance, aiming to instil a ritualistic engagement. This unique aspect provides a calming effect and distracts from daily stressors, contrasting with the prevalent 'use and throw away' mentality. It encourages users to engage deeply with the artefact, akin to maintaining a sacred or cherished item."},{"type":"image","id":"papyrus-users-image1","url":"/projects/sonart/img/5prototype.webp","description":"image"},{"type":"text","id":"sonart-challenge-text-2","headline":"Challenge Highlights","body":[{"Central Issue":"Addressing the high-stress lifestyle prevalent in Western societies.","Project Goal":"Develop an artefact that requires ongoing interaction, promoting a ritualistic and calming engagement.","Contrast with Modern Practices":"Moves away from the disposable culture towards maintenance and care.","Engagement Strategy":"Implementing ultrasonic sensors and a Bluetooth mouse to create an interactive art restoration experience.","Desired Outcome":"Reduce user stress through engaging, focused activity.","Evaluation Method":"Qualitative interviews with users to assess the artefact's effectiveness in providing satisfaction and intuitive interaction."}]}]},{"name":"Users","description":"Brainstorming and development of initial ideas for Sonart.","content":[{"type":"text","id":"sonart-users-text-1","headline":"User-Centred Design","body":"In the SonArt project, users played a pivotal role in the design process, actively participating through a user-centred approach that involved testing and providing qualitative feedback. Five classmates were invited to interact with the prototype and then engage in interviews to share their impressions and thoughts on the experience's intuitiveness. Their feedback was instrumental in shaping the iterative development of the project, pinpointing both its strengths and areas for improvement. This approach was key in ensuring that the final design was not only in line with user expectations but also enhanced in terms of usability and emotional impact."},{"type":"image","id":"papyrus-users-image1","url":"/projects/sonart/img/1prototype.webp","description":"image"},{"type":"text","id":"sonart-challenge-text-2","headline":"Key Points","body":[{"User Testing Method":"Interaction followed by a qualitative interview with structured questions.","Feedback Impact":"Directly influenced iterative improvements, such as fixing latency issues and enhancing device connectivity.","User Preferences":"Feedback led to the decision to vary the artwork daily and avoid personal photographs.","Additional Suggestions":"A participant suggested changing the mapping and setpoints for each session to keep the ritual engaging.","Intuitiveness and Engagement":"Users found the prototype interaction intuitive and engrossing.","Evaluation Outcome":"Adjustments made based on feedback ensured the prototype was user-friendly and met potential users' emotional and aesthetic needs."}]}]},{"name":"Solution","description":"Exploring the artistic and technical aspects of Sonart.","content":[{"type":"text","id":"sonart-solution-text-1","headline":"Design Process","body":"The SonArt project explored the concept of ritualistic art restoration as a method for stress relief. The design process was iterative, starting with broad ideation and narrowing down to the final artefact, which uses ultrasonic sensors and a Bluetooth mouse for user interaction. This artefact, displayed on a computer monitor, requires the user to actively participate in maintaining the artwork, thereby creating a calming, engaging ritual. The design evolved through various experimental stages, incorporating user feedback to refine the product and its interaction methods."},{"type":"image","id":"papyrus-users-image1","url":"/projects/sonart/img/final.webp","description":"image"},{"type":"text","id":"sonart-solution-text-2","headline":"Key Points","body":[{"Ultrasonic Interaction":"Two ultrasonic sensors allowed users to interact with the artwork by adjusting its appearance, mimicking the process of art restoration.","Bluetooth Mouse":"Used for finer control adjustments, affecting the artwork's saturation and applying a noise filter.","Art Display and Interaction":"Artwork displayed on a standard computer monitor, with the condition dynamically changing based on user interactions.","Ritualistic Engagement":"Designed to require regular user interaction, similar to the care needed for a living plant, fostering a ritualistic relationship between the user and the artefact.","Aesthetic and Practical Design":"The final design included a wooden and foam enclosure for electronics, improving the tactile quality and durability of the interactive setup.","Engagement Through Maintenance":"Users interact with the artwork to prevent its decay, akin to caring for a living plant, which enhances the user's focus and potentially reduces stress."}]}]},{"name":"Takeaways","description":"Takeaways from SonArt","content":[{"type":"text","id":"sonart-takeaways-text","headline":"Project Takeaways","body":[{"topic":"Enhancing User Engagement Through Ritualistic Interaction","challenge":"Modern lifestyles characterised by brief interactions with technology lack deeper, meaningful engagement, leading to a superficial relationship with digital content.","solution":"Introduced a concept where users interact with an artefact requiring regular, ritualistic engagement similar to maintaining a living system, fostering a sense of responsibility and continuity.","impact":"Participants found the ritualistic interaction to be deeply engaging and satisfying, suggesting a positive shift towards more mindful and sustained interactions with technology."},{"topic":"Utilising Ultrasonic Sensors for Intuitive User Interfaces","challenge":"Crafting an intuitive and engaging user interface that captivates users and encourages regular interaction.","solution":"Ultrasonic sensors allowed users to physically manipulate the digital artefact, providing a tactile and intuitive experience that differed from conventional digital interactions.","impact":"Using ultrasonic sensors was highly effective, with users reporting the interactions as intuitive and engaging, enhancing the overall user experience."},{"topic":"Addressing Stress Through Engaging Digital Experiences","challenge":"High-stress levels in modern society, due to constant connectivity and the fast pace of life, necessitate a solution for relaxation.","solution":"Create a digital artefact that requires mindful interaction to distract from stressors and engage users in a calming, restorative activity.","impact":"The artefact's design and interaction method potentially lowered user stress levels, effectively providing a brief but impactful mental diversion."},{"topic":"Future Potential of Interactive Artefacts in Home Environments","challenge":"Determining the long-term impact of interactive artefacts on user stress levels and engagement in a home setting.","solution":"We proposed an extended home-based trial of the interactive artefact to assess its effects over an extended period and in a naturalistic environment.","impact":"The project suggested a promising future for integrating interactive, engaging artefacts in home settings to foster routine engagement and improve mental well-being."}]}]}]}]